{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "True_Correct",
    "1": "False_Misconception",
    "2": "False_Neither",
    "3": "True_Neither"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "False_Misconception": 1,
    "False_Neither": 2,
    "True_Correct": 0,
    "True_Neither": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
